lkolbly/cmsis-svd/data/Atmel/ATSAML21E15A.svd
        <register>
          <name>CTRLA</name>
          <description>MODE2 Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>COUNT32</name>
                  <description>Mode 0: 32-bit Counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT16</name>
                  <description>Mode 1: 16-bit Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Mode 2: Clock/Calendar</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKREP</name>
              <description>Clock Representation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MATCHCLR</name>
              <description>Clear on Match</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/64</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/128</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/256</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/512</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>CLK_RTC_CNT = GCLK_RTC/1024</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCKSYNC</name>
              <description>Clock Read Synchronization Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x0E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run During Debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>MODE2 Event Control</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PEREO0</name>
              <description>Periodic Interval 0 Event Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO1</name>
              <description>Periodic Interval 1 Event Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO2</name>
              <description>Periodic Interval 2 Event Output Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO3</name>
              <description>Periodic Interval 3 Event Output Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO4</name>
              <description>Periodic Interval 4 Event Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO5</name>
              <description>Periodic Interval 5 Event Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO6</name>
              <description>Periodic Interval 6 Event Output Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEREO7</name>
              <description>Periodic Interval 7 Event Output Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALARMEO0</name>
              <description>Alarm 0 Event Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Overflow Event Output Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQCORR</name>
          <description>Frequency Correction</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SIGN</name>
              <description>Correction Sign</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GP%s</name>
          <description>General Purpose</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>MODE2 Interrupt Enable Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PER0</name>
              <description>Periodic Interval 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER1</name>
              <description>Periodic Interval 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER2</name>
              <description>Periodic Interval 2 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER3</name>
              <description>Periodic Interval 3 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER4</name>
              <description>Periodic Interval 4 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER5</name>
              <description>Periodic Interval 5 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER6</name>
              <description>Periodic Interval 6 Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER7</name>
              <description>Periodic Interval 7 Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>MODE2 Interrupt Enable Set</description>
          <addressOffset>0x0A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PER0</name>
              <description>Periodic Interval 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER1</name>
              <description>Periodic Interval 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER2</name>
              <description>Periodic Interval 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER3</name>
              <description>Periodic Interval 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER4</name>
              <description>Periodic Interval 4 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER5</name>
              <description>Periodic Interval 5 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER6</name>
              <description>Periodic Interval 6 Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER7</name>
              <description>Periodic Interval 7 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>MODE2 Interrupt Flag Status and Clear</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PER0</name>
              <description>Periodic Interval 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER1</name>
              <description>Periodic Interval 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER2</name>
              <description>Periodic Interval 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER3</name>
              <description>Periodic Interval 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER4</name>
              <description>Periodic Interval 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER5</name>
              <description>Periodic Interval 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER6</name>
              <description>Periodic Interval 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER7</name>
              <description>Periodic Interval 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALARM0</name>
              <description>Alarm 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVF</name>
              <description>Overflow</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>1</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>MASK%s</name>
          <description>MODE2 Alarm n Mask</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Alarm Mask Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SELSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Alarm Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SS</name>
                  <description>Match seconds only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMSS</name>
                  <description>Match seconds and minutes only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HHMMSS</name>
                  <description>Match seconds, minutes, and hours only</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDHHMMSS</name>
                  <description>Match seconds, minutes, hours, and days only</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, and months only</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YYMMDDHHMMSS</name>
                  <description>Match seconds, minutes, hours, days, months, and years</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>MODE2 Synchronization Busy Status</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Bit Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Bit Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FREQCORR</name>
              <description>FREQCORR Register Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLOCK</name>
              <description>CLOCK Register Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM0</name>
              <description>ALARM 0 Register Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASK0</name>
              <description>MASK 0 Register Busy</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLOCKSYNC</name>
              <description>Clock Read Synchronization Enable Bit Busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
       </cluster> <!-- RtcMode2 -->
      </registers>
    </peripheral>
    <peripheral>
      <name>SERCOM0</name>
      <version>2.2.0</version>
      <description>Serial Communication Interface 0</description>
      <groupName>SERCOM</groupName>
      <prependToName>SERCOM_</prependToName>
      <baseAddress>0x42000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SERCOM0</name>
        <value>8</value>
      </interrupt>
      <registers>
       <cluster>
        <name>I2CM</name>
        <description>I2C Master Mode</description>
        <headerStructName>SercomI2cm</headerStructName>
        <addressOffset>0x0</addressOffset>
        <register>
          <name>ADDR</name>
          <description>I2CM Address</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>LENEN</name>
              <description>Length Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HS</name>
              <description>High Speed Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TENBITEN</name>
              <description>Ten Bit Addressing Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LEN</name>
              <description>Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BAUD</name>
          <description>I2CM Baud Rate</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BAUD</name>
              <description>Baud Rate Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BAUDLOW</name>
              <description>Baud Rate Value Low</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HSBAUD</name>
              <description>High Speed Baud Rate Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HSBAUDLOW</name>
              <description>High Speed Baud Rate Value Low</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
