lkolbly/cmsis-svd/data/Atmel/ATSAML21E15A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <version>2.0.0</version>
      <description>Basic Timer Counter 0</description>
      <groupName>TC</groupName>
      <prependToName>TC_</prependToName>
      <baseAddress>0x42002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TC0</name>
        <value>17</value>
      </interrupt>
      <registers>
       <cluster>
        <name>COUNT8</name>
        <description>8-bit Counter Mode</description>
        <headerStructName>TcCount8</headerStructName>
        <addressOffset>0x0</addressOffset>
        <register>
          <dim>2</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>CC%s</name>
          <description>COUNT8 Compare and Capture</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Counter/Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>CCBUF%s</name>
          <description>COUNT8 Compare and Capture Buffer</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Counter/Compare Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>COUNT8 Count</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Timer Counter Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>COUNT16</name>
                  <description>Counter in 16-bit mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT8</name>
                  <description>Counter in 8-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT32</name>
                  <description>Counter in 32-bit mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCSYNC</name>
              <description>Prescaler and Counter Synchronization</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRESCSYNCSelect</name>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>Reload or reset the counter on next generic clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESC</name>
                  <description>Reload or reset the counter on next prescaler clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESYNC</name>
                  <description>Reload or reset the counter on next generic clock and reset the prescaler counter</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>Clock On Demand</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Prescaler: GCLK_TC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Prescaler: GCLK_TC/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Prescaler: GCLK_TC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Prescaler: GCLK_TC/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Prescaler: GCLK_TC/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Prescaler: GCLK_TC/64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Prescaler: GCLK_TC/256</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>Prescaler: GCLK_TC/1024</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALOCK</name>
              <description>Auto Lock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPTEN0</name>
              <description>Capture Channel 0 Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAPTEN1</name>
              <description>Capture Channel 1 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COPEN0</name>
              <description>Capture On Pin 0 Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COPEN1</name>
              <description>Capture On Pin 1 Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLBCLR</name>
          <description>Control B Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Counter Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONESHOT</name>
              <description>One-Shot on Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Force a start, restart or retrigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Force a stop</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force update of double-buffered register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READSYNC</name>
                  <description>Force a read synchronization of COUNT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAOS</name>
                  <description>One-shot DMA trigger</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLBSET</name>
          <description>Control B Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DIR</name>
              <description>Counter Direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LUPD</name>
              <description>Lock Update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONESHOT</name>
              <description>One-Shot on Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Force a start, restart or retrigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Force a stop</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Force update of double-buffered register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READSYNC</name>
                  <description>Force a read synchronization of COUNT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAOS</name>
                  <description>One-shot DMA trigger</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x0F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run During Debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DRVCTRL</name>
          <description>Control C</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>INVEN0</name>
              <description>Output Waveform Invert Enable 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN1</name>
              <description>Output Waveform Invert Enable 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Event Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Start, restart or retrigger TC on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Count on event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start TC on event</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAMP</name>
                  <description>Time stamp capture</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPW</name>
                  <description>Period catured in CC0, pulse width in CC1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWP</name>
                  <description>Period catured in CC1, pulse width in CC0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PW</name>
                  <description>Pulse width capture</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCINV</name>
              <description>TC Event Input Polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI</name>
              <description>TC Event Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Event Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO0</name>
              <description>MC Event Output Enable 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO1</name>
              <description>MC Event Output Enable 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Disable 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Disable 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Enable 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Enable 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Flag 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Flag 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>COUNT8 Period</description>
          <addressOffset>0x1B</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF</name>
          <description>COUNT8 Period Buffer</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>STOP</name>
              <description>Stop Status Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLAVE</name>
              <description>Slave Status Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERBUFV</name>
              <description>Synchronization Busy Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBUFV0</name>
              <description>Compare channel buffer 0 valid</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBUFV1</name>
              <description>Compare channel buffer 1 valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
